const data = [
          {
              "key": "root01",
              "label": "智慧停车总节点root01",
              "children": [
                  {
                      "key": "1754050507143430145",
                      "parentId": "-1",
                      "label": "智慧停车WEB",
                      "children": [
                          {
                              "key": "1754051154991431682",
                              "parentId": "1754050507143430145",
                              "label": "数据看板"
                          },
                          {
                              "key": "1754052890187579394",
                              "parentId": "1754050507143430145",
                              "label": "基础信息",
                              "children": [
                                  {
                                      "key": "1754054788235968513",
                                      "parentId": "1754052890187579394",
                                      "label": "内部车管理"
                                  },
                                  {
                                      "key": "1754054497159659522",
                                      "parentId": "1754052890187579394",
                                      "label": "黑名单管理"
                                  },
                                  {
                                      "key": "1759768357954961410",
                                      "parentId": "1754052890187579394",
                                      "label": "待审核管理"
                                  }
                              ]
                          },
                          {
                              "key": "1754060282497384449",
                              "parentId": "1754050507143430145",
                              "label": "统计分析",
                              "children": [
                                  {
                                      "key": "1754060507635040257",
                                      "parentId": "1754060282497384449",
                                      "label": "停车分析"
                                  },
                                  {
                                      "key": "1754060713592143874",
                                      "parentId": "1754060282497384449",
                                      "label": "收入分析"
                                  },
                                  {
                                      "key": "1760485151309086722",
                                      "parentId": "1754060282497384449",
                                      "label": "月卡分析"
                                  }
                              ]
                          }
                      ]
                  }
              ]
          },
          {
              "key": "root02",
              "label": "智慧运行监控root02",
              "children": [
                  {
                      "key": "1846748294424059906",
                      "parentId": "-1",
                      "label": "智慧运行监控WEB"
                  }
              ]
          },
          {
              "key": "root03",
              "label": "测试智慧宿舍root03",
              "children": [
                  {
                      "key": "1830889582560092161",
                      "parentId": "-1",
                      "label": "测试智慧宿舍WEB"
                  },
                  {
                      "key": "1830889582560092161",
                      "parentId": "-1",
                      "label": "测试智慧宿舍WEB的第二个内容"
                  }
              ]
          },
          {
              "key": "root04",
              "label": "数字化中台root04",
              "children": [
                  {
                      "key": "1670707481568489473",
                      "parentId": "-1",
                      "label": "数字化中台WEB",
                      "children": [
                          {
                              "key": "1838481866361171970",
                              "parentId": "1670707481568489473",
                              "label": "首页"
                          },
                          {
                              "key": "1670725633560547328",
                              "parentId": "1670707481568489473",
                              "label": "用户中心",
                              "children": [
                                  {
                                      "key": "1670734144235376640",
                                      "parentId": "1670725633560547328",
                                      "label": "用户管理",
                                      "children": [
                                          {
                                              "key": "1670802869089210368",
                                              "parentId": "1670734144235376640",
                                              "label": "新增"
                                          },
                                          {
                                              "key": "1670803636609093632",
                                              "parentId": "1670734144235376640",
                                              "label": "详情"
                                          },
                                          {
                                              "key": "1670803694888947712",
                                              "parentId": "1670734144235376640",
                                              "label": "编辑"
                                          },
                                      ]
                                  },
                                  {
                                      "key": "1670784776594001920",
                                      "parentId": "1670725633560547328",
                                      "label": "组织架构管理",
                                      "children": [
                                          {
                                              "key": "1670973696552210432",
                                              "parentId": "1670784776594001920",
                                              "label": "新增"
                                          },
                                          {
                                              "key": "1670973804467458048",
                                              "parentId": "1670784776594001920",
                                              "label": "编辑"
                                          },
                                      ]
                                  },
                                  {
                                      "key": "1670784877223743488",
                                      "parentId": "1670725633560547328",
                                      "label": "岗位管理",
                                      "children": [
                                          {
                                              "key": "1670974058839412736",
                                              "parentId": "1670784877223743488",
                                              "label": "新增"
                                          },
                                          {
                                              "key": "1670974153358053376",
                                              "parentId": "1670784877223743488",
                                              "label": "编辑"
                                          }
                                      ]
                                  }
                              ]
                          },
                          {
                              "key": "1742740210248015873",
                              "parentId": "1670707481568489473",
                              "label": "权限中心",
                              "children": [
                                  {
                                      "key": "1670785051706789888",
                                      "parentId": "1742740210248015873",
                                      "label": "角色管理",
                                      "children": [
                                          {
                                              "key": "1670974460624375808",
                                              "parentId": "1670785051706789888",
                                              "label": "新增"
                                          }
                                      ]
                                  },
                                  {
                                      "key": "1670707481568489474",
                                      "parentId": "1742740210248015873",
                                      "label": "权限管理"
                                  }
                              ]
                          },
                          {
                              "key": "1742740766525972482",
                              "parentId": "1670707481568489473",
                              "label": "应用中心",
                              "children": [
                                  {
                                      "key": "1670783660758142976",
                                      "parentId": "1742740766525972482",
                                      "label": "应用端点管理",
                                      "children": [
                                          {
                                              "key": "1670971579678593024",
                                              "parentId": "1670783660758142976",
                                              "label": "新增",
                                          },
                                          {
                                              "key": "1670971660842569728",
                                              "parentId": "1670783660758142976",
                                              "label": "删除",
                                          }
                                      ]
                                  },
                                  {
                                      "key": "1742749685650493441",
                                      "parentId": "1742740766525972482",
                                      "label": "功能管理",
                                      "children": [
                                          {
                                              "key": "1670707481568489475",
                                              "parentId": "1742749685650493441",
                                              "label": "新增",
                                          },
                                          {
                                              "key": "1670722384610725888",
                                              "parentId": "1742749685650493441",
                                              "label": "修改",
                                          },
                                          {
                                              "key": "1670722445411356672",
                                              "parentId": "1742749685650493441",
                                              "label": "删除",
                                          }
                                      ]
                                  },
                              ]
                          }
                      ]
                  },
                  {
                      "key": "1813019022903787521",
                      "parentId": "-1",
                      "label": "数字化中台WEB的第二个内容",
                  }
              ]
          }
      ]